Revit 2027 API
ImportExportFileFormat Enumeration
 Describes formats supported by import / export.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ImportExportFileFormat
Public Enumeration ImportExportFileFormat
public enum class ImportExportFileFormat
type ImportExportFileFormat
Members
Member name | Value | Description
AXM | 19 |  AXM format
Civil3D | 10 |  Civil3D format. Obsolete.
DGN | 9 |  DGN format
DWF | 2 |  DWF format
DWFX | 4 |  DWFX format
DWG | 1 |  DWG format
DXF | 12 |  DXF format
FBX | 7 |  FBX format
GBXML | 6 |  GBXML format
IFC | 14 |  IFC format
Image | 8 |  Image format
Inventor | 11 |  Inventor format
NWC | 15 |  Navisworks format
OBJ | 20 |  OBJ format
PDF | 16 |  PDF format
Rhino | 25 |  Rhino (3DM) format
SAT | 13 |  SAT format
SKP | 24 |  SKP format
STEP | 23 |  STEP format
STL | 17 |  STL format
See Also
Reference
Autodesk.Revit.DB Namespace